
&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
		НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");
		
		Если ПроверитьСуществованиеТовара(НазваниеТовара) Тогда
			ТекстСобщение = СтрШаблон("Товар %1 найден!", НазваниеТовара)
		Иначе
			ТекстСобщение = СтрШаблон("Товар %1 не найден!", НазваниеТовара)
		КонецЕсли;
		
		Сообщить(ТекстСобщение);
		
КонецПроцедуры

&НаСервере
Функция ПроверитьСуществованиеТовара(НазваниеТовара)
	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеПоНазванию(НазваниеТовара);
	Возврат ТоварСуществует;
КонецФункции